larg_group = {'కా' : 'का', 'కి' : 'कि', 'కీ' : 'की', 'కు' : 'कु', 'కూ' : 'कू', 'కృ' : 'कृ', 'కౄ' : 'कॄ', 'కౢ' : 'कॢ', 'కౣ' : 'कॣ', 'కె' : 'के', 'కై' : 'कै', 'క ం' : 'को', 'క ః' : 'कौ', 'ఖా' : 'खा', 'ఖి' : 'खि', 'ఖీ' : 'खी', 'ఖు' : 'खु', 'ఖూ' : 'खू', 'ఖృ' : 'खृ', 'ఖౄ' : 'खॄ', 'ఖౢ' : 'खॢ', 'ఖౣ' : 'खॣ', 'ఖె' : 'खे', 'ఖై' : 'खै', 'ఖ ం' : 'खो', 'ఖ ః ' : 'खौ', 'సిా' : 'गा', 'సిి' : 'गि', 'సిీ' : 'गी', 'సిు' : 'गु', 'సిూ' : 'गू', 'సిృ' : 'गृ', 'సిౄ' : 'गॄ',

'సిౢ' : 'गॢ', 'సిౣ' : 'गॣ', 'సిె' : 'गे', 'సిై' : 'गै', 'సి ం' : 'गो', 'సి ః ' : 'गौ', 'ఘా' : 'घा', 'ఘి' : 'घि', 'ఘీ' : 'घी', 'ఘు' : 'घु', 'ఘూ' : 'घू', 'ఘృ' : 'घृ', 'ఘౄ' : 'घॄ', 'ఘౢ' : 'घॢ', 'ఘౣ' : 'घॣ', 'ఘె' : 'घे', 'ఘై' : 'घै', 'ఘ ం' : 'घो', 'ఘ ః ' : 'घौ', 'ఇా' : 'ङा', 'ఇి' : 'ङि', 'ఇీ' : 'ङी', 'ఇు' : 'ङु', 'ఇూ' : 'ङू', 'ఇృ' : 'ङृ', 'ఇౄ' : 'ङॄ', 'ఇౢ' : 'ङॢ', 'ఇౣ' : 'ङॣ', 'ఇె' : 'ङे', 'ఇై' : 'ङै', 'ఇ ం' : 'ङो', 'ఇ ః ' : 'ङौ', 'చా' : 'चा',

'చి' : 'चि', 'చీ' : 'ची', 'చు' : 'चु', 'చూ' : 'चू', 'చృ' : 'चृ', 'చౄ' : 'चॄ', 'చౢ' : 'चॢ', 'చౣ' : 'चॣ', 'చె' : 'चे', 'చై' : 'चै', 'చ ం' : 'चो', 'చ ః ' : 'चौ', 'చా' : 'छा', 'చి' : 'छि', 'చీ' : 'छी', 'చు' : 'छु', 'చూ' : 'छू', 'చృ' : 'छृ', 'చౄ' : 'छॄ', 'చౢ' : 'छॢ', 'చౣ' : 'छॣ', 'చె' : 'छे', 'చై' : 'छै', 'చ ం' : 'छो', 'చ ః ' : 'छौ', 'జా' : 'जा', 'జి' : 'जि', 'జీ' : 'जी', 'జు' : 'जु', 'జూ' : 'जू', 'జృ' : 'जृ', 'జౄ' : 'जॄ', 'జౢ' : 'जॢ',

'జౣ' : 'जॣ', 'జె' : 'जे', 'జై' : 'जै', 'జ ం' : 'जो', 'జ ః ' : 'जौ', 'ఝా' : 'झा', 'ఝి' : 'झि', 'ఝీ' : 'झी', 'ఝు' : 'झु', 'ఝూ' : 'झू', 'ఝృ' : 'झृ', 'ఝౄ' : 'झॄ', 'ఝౢ' : 'झॢ', 'ఝౣ' : 'झॣ', 'ఝె' : 'झे', 'ఝై' : 'झै', 'ఝ ం' : 'झो', 'ఝ ః ' : 'झौ', 'ఞా' : 'ञा', 'ఞి' : 'ञि', 'ఞీ' : 'ञी', 'ఞు' : 'ञु', 'ఞూ' : 'ञू', 'ఞృ' : 'ञृ', 'ఞౄ' : 'ञॄ', 'ఞౢ' : 'ञॢ', 'ఞౣ' : 'ञॣ', 'ఞె' : 'ञे', 'ఞై' : 'ञै', 'ఞ ం' : 'ञो', 'ఞ ః ' : 'ञौ', 'టా' : 'टा', 'టి' : 'टि',

'టీ' : 'टी', 'టు' : 'टु', 'టూ' : 'टू', 'టృ' : 'टृ', 'టౄ' : 'टॄ', 'టౢ' : 'टॢ', 'టౣ' : 'टॣ', 'టె' : 'टे', 'టై' : 'टै', 'ట ం' : 'टो', 'ట ః ' : 'टौ', 'వా' : 'ठा', 'వి' : 'ठि', 'వీ' : 'ठी', 'వు' : 'ठु', 'వూ' : 'ठू', 'వృ' : 'ठृ', 'వౄ' : 'ठॄ', 'వౢ' : 'ठॢ', 'వౣ' : 'ठॣ', 'వె' : 'ठे', 'వై' : 'ठै', 'వ ం' : 'ठो', 'వ ః ' : 'ठौ', 'డా' : 'डा', 'డి' : 'डि', 'డీ' : 'डी', 'డు' : 'डु', 'డూ' : 'डू', 'డృ' : 'डृ', 'డౄ' : 'डॄ', 'డౢ' : 'डॢ', 'డౣ' : 'डॣ',

'డె' : 'डे', 'డై' : 'डै', 'డ ం' : 'डो', 'డ ః ' : 'डौ', 'ఢా' : 'ढा', 'ఢి' : 'ढि', 'ఢీ' : 'ढी', 'ఢు' : 'ढु', 'ఢూ' : 'ढू', 'ఢృ' : 'ढृ', 'ఢౄ' : 'ढॄ', 'ఢౢ' : 'ढॢ', 'ఢౣ' : 'ढॣ', 'ఢె' : 'ढे', 'ఢై' : 'ढै', 'ఢ ం' : 'ढो', 'ఢ ః ' : 'ढौ', 'ణా' : 'णा', 'ణి' : 'णि', 'ణీ' : 'णी', 'ణు' : 'णु', 'ణూ' : 'णू', 'ణృ' : 'णृ', 'ణౄ' : 'णॄ', 'ణౢ' : 'णॢ', 'ణౣ' : 'णॣ', 'ణె' : 'णे', 'ణై' : 'णै', 'ణ ం' : 'णो', 'ణ ః ' : 'णौ', 'టాా' : 'ता', 'టాి' : 'ति', 'టాీ' : 'ती',

'టాు' : 'तु', 'టాూ' : 'तू', 'టాృ' : 'तृ', 'టాౄ' : 'तॄ', 'టాౢ' : 'तॢ', 'టాౣ' : 'तॣ', 'టాె' : 'ते', 'టాై' : 'तै', 'టా ం' : 'तो', 'టా ః ' : 'तौ', 'థా' : 'था', 'థి' : 'थि', 'థీ' : 'थी', 'థు' : 'थु', 'థూ' : 'थू', 'థృ' : 'थृ', 'థౄ' : 'थॄ', 'థౢ' : 'थॢ', 'థౣ' : 'थॣ', 'థె' : 'थे', 'థై' : 'थै', 'థ ం' : 'थो', 'థ ః ' : 'थौ', 'దా' : 'दा', 'ది' : 'दि', 'దీ' : 'दी', 'దు' : 'दु', 'దూ' : 'दू', 'దృ' : 'दृ', 'దౄ' : 'दॄ', 'దౢ' : 'दॢ', 'దౣ' : 'दॣ', 'దె' : 'दे',

'దై' : 'दै', 'ద ం' : 'दो', 'ద ః ' : 'दौ', 'ధా' : 'धा', 'ధి' : 'धि', 'ధీ' : 'धी', 'ధు' : 'धु', 'ధూ' : 'धू', 'ధృ' : 'धृ', 'ధౄ' : 'धॄ', 'ధౢ' : 'धॢ', 'ధౣ' : 'धॣ', 'ధె' : 'धे', 'ధై' : 'धै', 'ధ ం' : 'धो', 'ధ ః ' : 'धौ', 'పా' : 'ना', 'పి' : 'नि', 'పీ' : 'नी', 'పు' : 'नु', 'పూ' : 'नू', 'పృ' : 'नृ', 'పౄ' : 'नॄ', 'పౢ' : 'नॢ', 'పౣ' : 'नॣ', 'పె' : 'ने', 'పై' : 'नै', 'ప ం' : 'नो', 'ప ః ' : 'नौ', 'పా' : 'पा', 'పి' : 'पि', 'పీ' : 'पी', 'పు' : 'पु',

'పూ' : 'पू', 'పృ' : 'पृ', 'పౄ' : 'पॄ', 'పౢ' : 'पॢ', 'పౣ' : 'पॣ', 'పె' : 'पे', 'పై' : 'पै', 'ప ం' : 'पो', 'ప ః ' : 'पौ', 'ఫా' : 'फा', 'ఫి' : 'फि', 'ఫీ' : 'फी', 'ఫు' : 'फु', 'ఫూ' : 'फू', 'ఫృ' : 'फृ', 'ఫౄ' : 'फॄ', 'ఫౢ' : 'फॢ', 'ఫౣ' : 'फॣ', 'ఫె' : 'फे', 'ఫై' : 'फै', 'ఫ ం' : 'फो', 'ఫ ః ' : 'फौ', 'బా' : 'बा', 'బి' : 'बि', 'బీ' : 'बी', 'బు' : 'बु', 'బూ' : 'बू', 'బృ' : 'बृ', 'బౄ' : 'बॄ', 'బౢ' : 'बॢ', 'బౣ' : 'बॣ', 'బె' : 'बे', 'బై' : 'बै',

'బ ం' : 'बो', 'బ ః ' : 'बौ', 'భా' : 'भा', 'భి' : 'भि', 'భీ' : 'भी', 'భు' : 'भु', 'భూ' : 'भू', 'భృ' : 'भृ', 'భౄ' : 'भॄ', 'భౢ' : 'भॢ', 'భౣ' : 'भॣ', 'భె' : 'भे', 'భై' : 'भै', 'భ ం' : 'भो', 'భ ః ' : 'भौ', 'మా' : 'मा', 'మి' : 'मि', 'మీ' : 'मी', 'ము' : 'मु', 'మూ' : 'मू', 'మృ' : 'मृ', 'మౄ' : 'मॄ', 'మౢ' : 'मॢ', 'మౣ' : 'मॣ', 'మె' : 'मे', 'మై' : 'मै', 'మ ం' : 'मो', 'మ ః ' : 'मौ', 'యా' : 'या', 'యి' : 'यि', 'యీ' : 'यी', 'యు' : 'यु', 'యూ' : 'यू',

'యృ' : 'यृ', 'యౄ' : 'यॄ', 'యౢ' : 'यॢ', 'యౣ' : 'यॣ', 'యె' : 'ये', 'యై' : 'यै', 'య ం' : 'यो', 'య ః ' : 'यौ', 'రా' : 'रा', 'రి' : 'रि', 'రీ' : 'री', 'రు' : 'रु', 'రూ' : 'रू', 'రృ' : 'रृ', 'రౄ' : 'रॄ', 'రౢ' : 'रॢ', 'రౣ' : 'रॣ', 'రె' : 'रे', 'రై' : 'रै', 'ర ం' : 'रो', 'ర ః ' : 'रौ', 'ఎల్ా' : 'ला', 'ఎల్ి' : 'लि', 'ఎల్ీ' : 'ली', 'ఎల్ు' : 'लु', 'ఎల్ూ' : 'लू', 'ఎల్ృ' : 'लृ', 'ఎల్ౄ' : 'लॄ', 'ఎల్ౢ' : 'लॢ', 'ఎల్ౣ' : 'लॣ', 'ఎల్ె' : 'ले', 'ఎల్ై' : 'लै', 'ఎల్ ం' : 'लो',

'ఎల్ ః ' : 'लौ', 'వా' : 'वा', 'వి' : 'वि', 'వీ' : 'वी', 'వు' : 'वु', 'వూ' : 'वू', 'వృ' : 'वृ', 'వౄ' : 'वॄ', 'వౢ' : 'वॢ', 'వౣ' : 'वॣ', 'వె' : 'वे', 'వై' : 'वै', 'వ ం' : 'वो', 'వ ః ' : 'वौ', 'శా' : 'शा', 'శి' : 'शि', 'శీ' : 'शी', 'శు' : 'शु', 'శూ' : 'शू', 'శృ' : 'शृ', 'శౄ' : 'शॄ', 'శౢ' : 'शॢ', 'శౣ' : 'शॣ', 'శె' : 'शे', 'శై' : 'शै', 'శ ం' : 'शो', 'శ ః ' : 'शौ', 'షా' : 'षा', 'షి' : 'षि', 'షీ' : 'षी', 'షు' : 'षु', 'షూ' : 'षू', 'షృ' : 'षृ',

'షౄ' : 'षॄ', 'షౢ' : 'षॢ', 'షౣ' : 'षॣ', 'షె' : 'षे', 'షై' : 'षै', 'ష ం' : 'षो', 'ష ః ' : 'षौ', 'లుా' : 'सा', 'లుి' : 'सि', 'లుీ' : 'सी', 'లుు' : 'सु', 'లుూ' : 'सू', 'లుృ' : 'सृ', 'లుౄ' : 'सॄ', 'లుౢ' : 'सॢ', 'లుౣ' : 'सॣ', 'లుె' : 'से', 'లుై' : 'सै', 'లు ం' : 'सो', 'లు ః ' : 'सौ', 'హాా' : 'हा', 'హాి' : 'हि', 'హాీ' : 'ही', 'హాు' : 'हु', 'హాూ' : 'हू', 'హాృ' : 'हृ', 'హాౄ' : 'हॄ', 'హాౢ' : 'हॢ', 'హాౣ' : 'हॣ', 'హాె' : 'हे', 'హాై' : 'है', 'హా ం' : 'हो', 'హా ః ' : 'हौ',
'క': 'क', 'ఖ': 'ख', 'సి': 'ग', 'ఘ': 'घ', 'ఇ': 'इ', 'చ': 'छ', 'జ': 'ज', 'ఝ': 'झ', 'ఞ': 'ञ', 'ట': 'ट', 'వ': 'व', 'డ': 'ड', 'ఢ': 'ढ', 'ణ': 'ण', 'టా': 'त', 'థ': 'थ', 'ద': 'द', 'ధ': 'ध', 'ప': 'प', 'ఫ': 'फ', 'బ': 'ब', 'భ': 'भ', 'మ': 'म', 'య': 'य', 'ర': 'र', 'ఎల్': 'ल', 'శ': 'श', 'ష': 'ष', 'లు': 'स', 'హా': 'ह', 'అ ': 'अ', 'ఆ': 'आ', 'ఈ': 'ई', 'ఉ': 'उ', 'ఊ': 'ऊ', 'ఋ': 'ऋ',
'ౠ': 'ॠ', 'ఌ': 'ऌ', 'ౡ': 'ॡ', 'ఎ': 'ए', 'ఐ': 'ऐ', 'ఒ': 'ओ', 'ఔ': 'औ', 'ా': 'ा', 'ి': 'ि', 'ీ': 'ी', 'ు': 'ु', 'ూ': 'ू', 'ృ': 'ृ', 'ౄ': 'ॄ', 'ౢ': 'ॢ', 'ౣ': 'ॣ', 'ె': 'े', 'ై': 'ै', ' ం': 'ो', ' ః ': 'ौ', '0': '०', '1': '१', '2': '२', '3': '३', '4': '४', '5': '५', '6': '६', '7': '७', '8': '८', '9': '९', ' ': ' ',

}

def lib(a):
    kk=0
    ss=a
    cc = " "
    ll = ss.split()
    print(ll)
    jj = 0
    for s in ll:
        i = s
        # print(type(i))
        for j in range(len(i)):
            lol = 0
            lo = i[:4]
            lo2 = i[:3]
            lo3 = i[:2]
            lo4 = i[:2]
            if lo in larg_group:
                cc +=  larg_group[lo]
                lol += 1
                i = i[4:]

            elif lo2 in larg_group:
                cc += larg_group[lo2]
                lol += 1
                i = i[3:]
            elif lo3 in larg_group:
                cc += larg_group[lo3]
                lol += 1
                i = i[2:]
            elif lo4 in larg_group:
                cc += larg_group[lo4]
                lol += 1
                i = i[1:]

            else:
                i = i[1:]
            #
            # if lol==0:
            #     i=i[1:]
        cc+=' '
        print(end=' ')
    print(cc)
    return cc