
larg_group = {
'ka' : 'क', 'kha' : 'ख', 'ga' : 'ग', 'gha' : 'घ', 'nga' : 'ङ', 'ca' : 'च', 'cha' : 'छ', 'ja' : 'ज', 'jha' : 'झ', 'ña' : 'ञ', 'Ṭa' : 'ट', 'Ṭha' : 'ठ', 'Ḍa' : 'ड', 'Ḍha' : 'ढ', 'Ṇa' : 'ण', 'ta' : 'त', 'tha' : 'थ', 'da' : 'द', 'dha' : 'ध', 'na' : 'न', 'pa' : 'प', 'pha' : 'फ', 'ba' : 'ब', 'bha' : 'भ', 'ma' : 'म', 'ya' : 'य', 'ra' : 'र', 'la' : 'ल', 'va' : 'व', 'śa' : 'श', 'Ṣa' : 'ष', 'sa' : 'स', 'ha' : 'ह',

'kā' : 'का', 'ki' : 'कि', 'kī' : 'की', 'ku' : 'कु', 'kū' : 'कू', 'kri' : 'कृ', 'krī' : 'कॄ', 'kli' : 'कॢ', 'klī' : 'कॣ', 'ke' : 'के', 'kai' : 'कै', 'ko' : 'को', 'kau' : 'कौ', 'khā' : 'खा', 'khi' : 'खि', 'khī' : 'खी', 'khu' : 'खु', 'khū' : 'खू', 'khri' : 'खृ', 'khrī' : 'खॄ', 'khli' : 'खॢ', 'khlī' : 'खॣ', 'khe' : 'खे', 'khai' : 'खै', 'kho' : 'खो', 'khau' : 'खौ', 'gā' : 'गा', 'gi' : 'गि', 'gī' : 'गी', 'gu' : 'गु', 'gū' : 'गू', 'gri' : 'गृ', 'grī' : 'गॄ',

'gli' : 'गॢ', 'glī' : 'गॣ', 'ge' : 'गे', 'gai' : 'गै', 'go' : 'गो', 'gau' : 'गौ', 'ghā' : 'घा', 'ghi' : 'घि', 'ghī' : 'घी', 'ghu' : 'घु', 'ghū' : 'घू', 'ghri' : 'घृ', 'ghrī' : 'घॄ', 'ghli' : 'घॢ', 'ghlī' : 'घॣ', 'ghe' : 'घे', 'ghai' : 'घै', 'gho' : 'घो', 'ghau' : 'घौ', 'ngā' : 'ङा', 'ngi' : 'ङि', 'ngī' : 'ङी', 'ngu' : 'ङु', 'ngū' : 'ङू', 'ngri' : 'ङृ', 'ngrī' : 'ङॄ', 'ngli' : 'ङॢ', 'nglī' : 'ङॣ', 'nge' : 'ङे', 'ngai' : 'ङै', 'ngo' : 'ङो', 'ngau' : 'ङौ', 'cā' : 'चा',

'ci' : 'चि', 'cī' : 'ची', 'cu' : 'चु', 'cū' : 'चू', 'cri' : 'चृ', 'crī' : 'चॄ', 'cli' : 'चॢ', 'clī' : 'चॣ', 'ce' : 'चे', 'cai' : 'चै', 'co' : 'चो', 'cau' : 'चौ', 'chā' : 'छा', 'chi' : 'छि', 'chī' : 'छी', 'chu' : 'छु', 'chū' : 'छू', 'chri' : 'छृ', 'chrī' : 'छॄ', 'chli' : 'छॢ', 'chlī' : 'छॣ', 'che' : 'छे', 'chai' : 'छै', 'cho' : 'छो', 'chau' : 'छौ', 'jā' : 'जा', 'ji' : 'जि', 'jī' : 'जी', 'ju' : 'जु', 'jū' : 'जू', 'jri' : 'जृ', 'jrī' : 'जॄ', 'jli' : 'जॢ',

'jlī' : 'जॣ', 'je' : 'जे', 'jai' : 'जै', 'jo' : 'जो', 'jau' : 'जौ', 'jhā' : 'झा', 'jhi' : 'झि', 'jhī' : 'झी', 'jhu' : 'झु', 'jhū' : 'झू', 'jhri' : 'झृ', 'jhrī' : 'झॄ', 'jhli' : 'झॢ', 'jhlī' : 'झॣ', 'jhe' : 'झे', 'jhai' : 'झै', 'jho' : 'झो', 'jhau' : 'झौ', 'ñā' : 'ञा', 'ñi' : 'ञि', 'ñī' : 'ञी', 'ñu' : 'ञु', 'ñū' : 'ञू', 'ñri' : 'ञृ', 'ñrī' : 'ञॄ', 'ñli' : 'ञॢ', 'ñlī' : 'ञॣ', 'ñe' : 'ञे', 'ñai' : 'ञै', 'ño' : 'ञो', 'ñau' : 'ञौ', 'Ṭā' : 'टा', 'Ṭi' : 'टि',

'Ṭī' : 'टी', 'Ṭu' : 'टु', 'Ṭū' : 'टू', 'Ṭri' : 'टृ', 'Ṭrī' : 'टॄ', 'Ṭli' : 'टॢ', 'Ṭlī' : 'टॣ', 'Ṭe' : 'टे', 'Ṭai' : 'टै', 'Ṭo' : 'टो', 'Ṭau' : 'टौ', 'Ṭhā' : 'ठा', 'Ṭhi' : 'ठि', 'Ṭhī' : 'ठी', 'Ṭhu' : 'ठु', 'Ṭhū' : 'ठू', 'Ṭhri' : 'ठृ', 'Ṭhrī' : 'ठॄ', 'Ṭhli' : 'ठॢ', 'Ṭhlī' : 'ठॣ', 'Ṭhe' : 'ठे', 'Ṭhai' : 'ठै', 'Ṭho' : 'ठो', 'Ṭhau' : 'ठौ', 'Ḍā' : 'डा', 'Ḍi' : 'डि', 'Ḍī' : 'डी', 'Ḍu' : 'डु', 'Ḍū' : 'डू', 'Ḍri' : 'डृ', 'Ḍrī' : 'डॄ', 'Ḍli' : 'डॢ', 'Ḍlī' : 'डॣ',

'Ḍe' : 'डे', 'Ḍai' : 'डै', 'Ḍo' : 'डो', 'Ḍau' : 'डौ', 'Ḍhā' : 'ढा', 'Ḍhi' : 'ढि', 'Ḍhī' : 'ढी', 'Ḍhu' : 'ढु', 'Ḍhū' : 'ढू', 'Ḍhri' : 'ढृ', 'Ḍhrī' : 'ढॄ', 'Ḍhli' : 'ढॢ', 'Ḍhlī' : 'ढॣ', 'Ḍhe' : 'ढे', 'Ḍhai' : 'ढै', 'Ḍho' : 'ढो', 'Ḍhau' : 'ढौ', 'Ṇā' : 'णा', 'Ṇi' : 'णि', 'Ṇī' : 'णी', 'Ṇu' : 'णु', 'Ṇū' : 'णू', 'Ṇri' : 'णृ', 'Ṇrī' : 'णॄ', 'Ṇli' : 'णॢ', 'Ṇlī' : 'णॣ', 'Ṇe' : 'णे', 'Ṇai' : 'णै', 'Ṇo' : 'णो', 'Ṇau' : 'णौ', 'tā' : 'ता', 'ti' : 'ति', 'tī' : 'ती',

'tu' : 'तु', 'tū' : 'तू', 'tri' : 'तृ', 'trī' : 'तॄ', 'tli' : 'तॢ', 'tlī' : 'तॣ', 'te' : 'ते', 'tai' : 'तै', 'to' : 'तो', 'tau' : 'तौ', 'thā' : 'था', 'thi' : 'थि', 'thī' : 'थी', 'thu' : 'थु', 'thū' : 'थू', 'thri' : 'थृ', 'thrī' : 'थॄ', 'thli' : 'थॢ', 'thlī' : 'थॣ', 'the' : 'थे', 'thai' : 'थै', 'tho' : 'थो', 'thau' : 'थौ', 'dā' : 'दा', 'di' : 'दि', 'dī' : 'दी', 'du' : 'दु', 'dū' : 'दू', 'dri' : 'दृ', 'drī' : 'दॄ', 'dli' : 'दॢ', 'dlī' : 'दॣ', 'de' : 'दे',

'dai' : 'दै', 'do' : 'दो', 'dau' : 'दौ', 'dhā' : 'धा', 'dhi' : 'धि', 'dhī' : 'धी', 'dhu' : 'धु', 'dhū' : 'धू', 'dhri' : 'धृ', 'dhrī' : 'धॄ', 'dhli' : 'धॢ', 'dhlī' : 'धॣ', 'dhe' : 'धे', 'dhai' : 'धै', 'dho' : 'धो', 'dhau' : 'धौ', 'nā' : 'ना', 'ni' : 'नि', 'nī' : 'नी', 'nu' : 'नु', 'nū' : 'नू', 'nri' : 'नृ', 'nrī' : 'नॄ', 'nli' : 'नॢ', 'nlī' : 'नॣ', 'ne' : 'ने', 'nai' : 'नै', 'no' : 'नो', 'nau' : 'नौ', 'pā' : 'पा', 'pi' : 'पि', 'pī' : 'पी', 'pu' : 'पु',

'pū' : 'पू', 'pri' : 'पृ', 'prī' : 'पॄ', 'pli' : 'पॢ', 'plī' : 'पॣ', 'pe' : 'पे', 'pai' : 'पै', 'po' : 'पो', 'pau' : 'पौ', 'phā' : 'फा', 'phi' : 'फि', 'phī' : 'फी', 'phu' : 'फु', 'phū' : 'फू', 'phri' : 'फृ', 'phrī' : 'फॄ', 'phli' : 'फॢ', 'phlī' : 'फॣ', 'phe' : 'फे', 'phai' : 'फै', 'pho' : 'फो', 'phau' : 'फौ', 'bā' : 'बा', 'bi' : 'बि', 'bī' : 'बी', 'bu' : 'बु', 'bū' : 'बू', 'bri' : 'बृ', 'brī' : 'बॄ', 'bli' : 'बॢ', 'blī' : 'बॣ', 'be' : 'बे', 'bai' : 'बै',

'bo' : 'बो', 'bau' : 'बौ', 'bhā' : 'भा', 'bhi' : 'भि', 'bhī' : 'भी', 'bhu' : 'भु', 'bhū' : 'भू', 'bhri' : 'भृ', 'bhrī' : 'भॄ', 'bhli' : 'भॢ', 'bhlī' : 'भॣ', 'bhe' : 'भे', 'bhai' : 'भै', 'bho' : 'भो', 'bhau' : 'भौ', 'mā' : 'मा', 'mi' : 'मि', 'mī' : 'मी', 'mu' : 'मु', 'mū' : 'मू', 'mri' : 'मृ', 'mrī' : 'मॄ', 'mli' : 'मॢ', 'mlī' : 'मॣ', 'me' : 'मे', 'mai' : 'मै', 'mo' : 'मो', 'mau' : 'मौ', 'yā' : 'या', 'yi' : 'यि', 'yī' : 'यी', 'yu' : 'यु', 'yū' : 'यू',

'yri' : 'यृ', 'yrī' : 'यॄ', 'yli' : 'यॢ', 'ylī' : 'यॣ', 'ye' : 'ये', 'yai' : 'यै', 'yo' : 'यो', 'yau' : 'यौ', 'rā' : 'रा', 'ri' : 'रि', 'rī' : 'री', 'ru' : 'रु', 'rū' : 'रू', 'rri' : 'रृ', 'rrī' : 'रॄ', 'rli' : 'रॢ', 'rlī' : 'रॣ', 're' : 'रे', 'rai' : 'रै', 'ro' : 'रो', 'rau' : 'रौ', 'lā' : 'ला', 'li' : 'लि', 'lī' : 'ली', 'lu' : 'लु', 'lū' : 'लू', 'lri' : 'लृ', 'lrī' : 'लॄ', 'lli' : 'लॢ', 'llī' : 'लॣ', 'le' : 'ले', 'lai' : 'लै', 'lo' : 'लो',

'lau' : 'लौ', 'vā' : 'वा', 'vi' : 'वि', 'vī' : 'वी', 'vu' : 'वु', 'vū' : 'वू', 'vri' : 'वृ', 'vrī' : 'वॄ', 'vli' : 'वॢ', 'vlī' : 'वॣ', 've' : 'वे', 'vai' : 'वै', 'vo' : 'वो', 'vau' : 'वौ', 'śā' : 'शा', 'śi' : 'शि', 'śī' : 'शी', 'śu' : 'शु', 'śū' : 'शू', 'śri' : 'शृ', 'śrī' : 'शॄ', 'śli' : 'शॢ', 'ślī' : 'शॣ', 'śe' : 'शे', 'śai' : 'शै', 'śo' : 'शो', 'śau' : 'शौ', 'Ṣā' : 'षा', 'Ṣi' : 'षि', 'Ṣī' : 'षी', 'Ṣu' : 'षु', 'Ṣū' : 'षू', 'Ṣri' : 'षृ',

'Ṣrī' : 'षॄ', 'Ṣli' : 'षॢ', 'Ṣlī' : 'षॣ', 'Ṣe' : 'षे', 'Ṣai' : 'षै', 'Ṣo' : 'षो', 'Ṣau' : 'षौ', 'sā' : 'सा', 'si' : 'सि', 'sī' : 'सी', 'su' : 'सु', 'sū' : 'सू', 'sri' : 'सृ', 'srī' : 'सॄ', 'sli' : 'सॢ', 'slī' : 'सॣ', 'se' : 'से', 'sai' : 'सै', 'so' : 'सो', 'sau' : 'सौ', 'hā' : 'हा', 'hi' : 'हि', 'hī' : 'ही', 'hu' : 'हु', 'hū' : 'हू', 'hri' : 'हृ', 'hrī' : 'हॄ', 'hli' : 'हॢ', 'hlī' : 'हॣ', 'he' : 'हे', 'hai' : 'है', 'ho' : 'हो', 'hau' : 'हौ',
}
print(len(larg_group))
def lib(a):
    kk=0
    ss=a
    cc = " "
    ll = ss.split()
    print(ll)
    jj = 0
    for s in ll:
        i = s
        # print(type(i))
        for j in range(len(i)):
            lol = 0
            lo = i[:3]
            lo2 = i[:2]
            if lo in larg_group:
                cc +=  larg_group[lo]
                lol += 1
                i = i[3:]

            elif lo2 in larg_group:
                cc += larg_group[lo2]
                lol += 1
                i = i[2:]

            else:
                i = i[1:]
            #
            # if lol==0:
            #     i=i[1:]
        cc+=' '
        print(end=' ')
    print(cc)
    return cc