prons = {'क': 'క','ख':"ఖ" , 'ग':"సి" ,'घ':'ఘ' ,'ङ':"ఇ" ,'च':"చ" ,'छ':"చ" ,'ज':"జ" ,'झ':"ఝ" ,'ञ':"ఞ" ,'ट': "ట",'ठ':"వ" ,'ड':"డ" ,'ढ': "ఢ",'ण':"ణ",
    'त':"టా" ,'थ':"థ" ,'द':"ద" ,'ध':"ధ", 'न':"ప" ,'प':"ప" ,'फ':"ఫ" ,'ब':"బ" ,'भ':"భ" ,'म':"మ" ,'य':"య" ,'र':"ర" ,'ल':"ఎల్" ,'व':"వ" ,'श':"శ" ,'ष':"ష" ,'स':"లు" ,'ह':"హా"}

mainw = {'अ':"అ " ,'आ':"ఆ" ,'इ':"ఇ" ,'ई':"ఈ" ,'उ':"ఉ" ,'ऊ':"ఊ", 'ऋ':"ఋ" ,'ॠ':"ౠ" ,'ऌ':"ఌ" ,"ॡ":"ౡ" ,'ए':"ఎ" ,'ऐ':"ఐ" ,'ओ':"ఒ" ,'औ':"ఔ" }

subw = {'ा':"ా" ,'ि':"ి" ,'ी':"ీ" ,'ु':"ు" ,'ू':'ూ' ,'ृ':"ృ"  ,'ॄ':"ౄ"  ,'ॢ':"ౢ" ,'ॣ':"ౣ" ,'े':"ె" ,'ै':"ై" ,'ो':" ం" ,'ौ':" ః "}

nuber = {'०':"0" ,'१':"1" ,'२':"2" ,'३':"3" ,'४':"4" ,'५':"5" ,'६':"6" ,'७':"7" ,'८':"8",'९':"9"," ":" "}
kk = 0
for i in prons:
    for j in subw:
        kk+=1
        print("'{}' : '{}',".format(prons[i]+subw[j],i+j),end= ' ')
        if kk == 33:
            kk = 0
            print("\n")

larg_group = {}

